
* Simulating the frequentist interpretain

#+BEGIN_SRC R :exports both :session 
  n = 10^5
  child1 = sample(2, n, replace = TRUE)
  child2 = sample(2, n, replace = TRUE)
  child3 = sample(10, 4)
  head(child2)
#+END_SRC

#+RESULTS:
| 2 |
| 1 |
| 1 |
| 2 |
| 2 |
| 2 |

#+BEGIN_SRC R :exports both :session 
  example = sample(c("girl", "boy"), n, replace = TRUE)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :session 
  n.b = sum(child1)
  n.ab = sum(child1==1 & child2==1)
  n.ab/n.b
#+END_SRC

#+RESULTS:
: 0.166377920226022

#+BEGIN_SRC R :exports both :session 
  n.b = sum(child1==1 | child2==1)
  n.ab = sum(child1==1 & child2==1)
  n.ab/n.b
#+END_SRC

#+RESULTS:
: 0.333235462904883

* Monty Hall simulation
#+BEGIN_SRC R :exports both :session 
  n = 10^5
  cardoor = sample(3, n, replace = TRUE)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :session 
  monty = function() {
    doors = 1:3
    farodoor = sample(doors,1)
    print("Monty Hall says 'Pick a door, any door!'")

    monty = function() {
  doors = 1:3
  farodoor = sample(doors,1)
  print("Monty Hall says 'Pick a door, any door!'")

  chosen = scan(what = integer(), nlines = 1, quiet = TRUE)
  if (chosen != cardoor) montydoor = doors[-c(chosen, cardoor)]
  else montydoor = sample(doors[-chosen], 1)

  print(paste("Monty opens door", montydoor, "!", seq=""))
  reply = scan(what = character(), nlines = 1, quite = TRUE)
  if (substr(reply,1,1) == "y")  chosen = doors[-c(chisen, montydoors)]

  if (chosen == cardoor) print("You won!")
  else print("You lost!")
}chosen = scan(what = integer(), nlines = 1, quiet = TRUE)
    if (chosen != cardoor) montydoor = doors[-c(chosen, cardoor)]
    else montydoor = sample(doors[-chosen], 1)

    print(paste("Monty opens door", montydoor, "!", seq="")) 
    reply = scan(what = character(), nlines = 1, quite = TRUE)
    if (substr(reply,1,1) == "y")  chosen = doors[-c(chisen, montydoors)]

    if (chosen == cardoor) print("You won!")
    else print("You lost!")
  }
#+END_SRC

#+RESULTS:




* Exercise
** 第五题
